Repository: fsg-ulaval/t3ext-oidc
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: de

# fe_groups.tx_oidc_pattern
source: Case-insensitive pattern to match OpenID Connect role names ("*" matches every character, "|" to separate expressions)
de: Groß-/Kleinschreibung-unempfindliches Muster zum Abgleichen von OpenID Connect-Rollennamen ("*" passt zu jedem Zeichen, "|" zu getrennten Ausdrücken)

# be_groups.tx_oidc_pattern
source: Case-insensitive pattern to match OpenID Connect role names ("*" matches every character, "|" to separate expressions)
de: Groß-/Kleinschreibung-unempfindliches Muster zum Abgleichen von OpenID Connect-Rollennamen ("*" passt zu jedem Zeichen, "|" zu getrennten Ausdrücken)

# settings.authenticationServicePriority
source: Authentication service priority: This defines the order of the OIDC authentication service in relation to other authentication services. Higher number wins.
de: Authentifizierungs-Service Priorität: Definiert die Reihenfolge des OIDC Authentifizierungs-Service in Bezug auf andere Authentifizierungs-Services. Höhere Zahl gewinnt.

# settings.authenticationServiceQuality
source: Authentication service Quality: This is used by TYPO3 if two authentication services have the same priority. Higher number wins.
de: Authentifizierungs-Service Qualität: TYPO3 nutzt diesen Wert, wenn zwei Authentifizierungs-Services die gleiche Priorität besitzen. Höhere Zahl gewinnt.

# settings.authenticationUrlRoute
source: Route for retrieving the authentication URL of the Identity Provider
de: Route um die Authentifzierungs-URL des Identitäts-Anbieters zu erhalten

# settings.adminRole
source: Name of the role that elevates the user to administrator: If none, the authentication service doesn't manage that capability.
de: Name der Rolle, die den Benutzer zum Administrator macht: Wenn keine vorhanden ist, verwaltet der Authentifizierungsdienst diese Funktion nicht.

# settings.maintainerRole
source: Name of the role that elevates the user to maintainer
de: Name der Rolle, die den Benutzer zum Betreuer erhebt

# settings.enableCodeVerifier
source: Enable PKCE: Enable PKCE flow. Code challenge and code verifier will be sent along.
de: PKCE aktivieren: Aktiviert den PKCE-Fluss. Code-Challenge und Code-Verifier werden mitgeschickt.

# settings.enableAuthentication
source: Authentication: Enable OpenID Connect authentication for the or backend.
de: Authentifizierung: Aktivieren Sie die OpenID Connect-Authentifizierung für das Frontend oder Backend.

# settings.enablePasswordCredentials
source: Enable username/password authentication: Enable authentication with username/password via OpenID Connect. e.g. via felogin
de: Authentifizierung mittels Benutzername/Passwort aktivieren: Aktiviere Authentifizierung mittels Benutzername/Passwort über OpenID Connect. z.B. über felogin

# settings.userMustExistLocally
source: User Must Exist: If ticked, only Users who are present locally in TYPO3 will be able to authenticate with OpenID Connect. You may need to watch logs to find users who could not authenticate.
de: Benutzer muss vorhanden sein: Wenn dieses Häkchen gesetzt ist, können sich nur Benutzer, die lokal in TYPO3 vorhanden sind, mit OpenID Connect authentifizieren. Möglicherweise müssen Sie die Logs beobachten, um Benutzer zu finden, die sich nicht authentifizieren konnten.

# settings.oauthProviderFactory
source: OAuth Provider Factory: Fully qualified class name (empty for generic provider).
de: OAuth Provider Factory: Voll qualifizierter Klassenname (leer für generic provider)

# settings.oidcAuthorizeLanguageParameter
source: Authorize request language parameter name
de: Name des Sprachparameters für die Autorisierungsanfrage

# settings.oidcClientKey
source: Client Key
de: Client ID

# settings.oidcDisableCSRFProtection
source: Disable CSRF attack mitigation: CAUTION! This is a security protection which checks the return state with the expected value. Disable this protection at your own risk.
de: Deaktivieren Sie die Abschwächung von CSRF-Angriffen: ACHTUNG! Dies ist ein Sicherheitsschutz, der den Rückgabewert mit dem erwarteten Wert abgleicht. Deaktivieren Sie diesen Schutz auf Ihr eigenes Risiko.

# settings.oidcEndpointAuthorize
source: Endpoint URI for authorization
de: Endpunkt-URI für Autorisierung

# settings.oidcEndpointLogout
source: Endpoint URI for logout
de: Endpunkt-URI für Logout

# settings.oidcEndpointRevoke
source: Endpoint URI for revoking the token
de: Endpunkt-URI für das Widerrufen des Tokens

# settings.oidcEndpointToken
source: Endpoint URI for retrieving a token
de: Endpunkt-URI zum Abrufen eines Tokens

# settings.oidcEndpointUserInfo
source: Endpoint URI for fetching user information
de: Endpunkt-URI für das Abrufen von Benutzerinformationen

# settings.oidcRedirectUri
source: Redirect URI: The authentication server callback will point to this URI.
de: Redirect URI: Der Callback des Authentifizierungsservers wird auf diese URI verweisen.

# settings.oidcUseRequestPathAuthentication
source: Use Request Path Authentication: When ticked, this value will use Request Path Authentication instead of standard Password Grant.
de: Anfragepfad-Authentifizierung verwenden: Wenn dieser Wert angekreuzt ist, wird die Request Path Authentication anstelle der standardmäßigen Password Grant verwendet.

# settings.reEnableUsers
source: Re-enable Users: If ticked, will automatically re-enable users marked as "disabled" upon successful authentication.
de: Benutzer wieder aktivieren: Wenn angekreuzt, werden als "deaktiviert" markierte Benutzer nach erfolgreicher Authentifizierung automatisch wieder aktiviert.

# settings.revokeAccessTokenAfterLogin
source: Revoke TYPO3's access token at the end of the login process
de: Zugriffstoken von TYPO3 am Ende des Anmeldevorgangs widerrufen

# settings.undeleteUsers
source: Undelete Users: If ticked, will automatically restore users marked as "deleted" upon successful authentication.
de: Benutzer wiederherstellen: Wenn angekreuzt, werden als "gelöscht" markierte Benutzer nach erfolgreicher Authentifizierung automatisch wiederhergestellt.

# settings.usersDefaultGroup
source: Default user group(s) (comma-separated list of UIDs)
de: Standard-Benutzergruppen (komma-separierte Liste von UIDs)

# settings.usersStoragePid
source: Storage Pid: Comma-separated list of page UIDs where fe_users are located. The first UID is used to store new users.
de: Ablage Pid: Komma-separierte Liste der Seiten UIDs, wo fe_users gespeichert werden. Die erste UID wird zur Speicherung neuer Benutzer verwendet.

# settings.userIDClaim
source: Claim to use to reliably identify a user
de: Anspruch auf Verwendung zur zuverlässigen Identifizierung eines Benutzers

# tt_content.oidc_login
source: OIDC Login
de: OIDC-Anmeldung

# backend.login.link
source: Login with OpenID Connect
de: Anmeldung mit OpenID Connect

# login.error.description
source: It appears you do not have access to this environment. Please contact your local administrator if you believe this is an error.
de: Sie haben offenbar keinen Zugriff auf diese Umgebung. Wenden Sie sich an Ihren lokalen Administrator, wenn Sie glauben, dass es sich um einen Fehler handelt.
